ПД_sev/src/Tasks/ЗадачиПользователя/ЗадачиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиПользователя</name>
  <basedOn>Catalog.Проекты</basedOn>
  <addressing>InformationRegister.РегистрАдресации</addressing>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

ПД_sev/src/Tasks/ЗадачиПользователя/Forms/Напоминание/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Исполнитель = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
	Объект.Куратор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
	
	Если Параметры.Свойство("Объект") Тогда 
		Объект.Объект = Параметры.Объект;
		Объект.Наименование = ОбщегоНазначения.ПредметСтрокой(Объект.Объект);
		Элементы.ПредметНапоминания.Заголовок = ОбщегоНазначения.ПредметСтрокой(Объект.Объект);
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Объект.Источник) Тогда
	//	ЗаполнитьСписокРеквизитовИсточника();
	//КонецЕсли;
	
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСрокиПовторногоНапоминания();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСрокиПовторногоНапоминания()
	Для Каждого Элемент Из Элементы.СрокПовторногоОповещения.СписокВыбора Цикл
		Элемент.Представление = РаботаСНапоминаниямиКлиент.ОформитьВремя(Элемент.Значение); 
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ПредметНапоминанияНажатие(Элемент)
	Если ЗначениеЗаполнено(Объект.Объект) Тогда
		ПоказатьЗначение(, Объект.Объект)
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ИнтервалВремени = РаботаСНапоминаниямиКлиент.ПолучитьИнтервалВремениИзСтроки(СпособУстановкиВремениНапоминания);
	ТекДата = ТекущаяДата();
	Объект.СрокНапоминания = ТекДата + ИнтервалВремени;
	Объект.ВремяВыполнения = Объект.СрокНапоминания; 
	Записать();
	Состояние(НСтр("ru = 'Напоминание добавлено'"));
	Закрыть();
КонецПроцедуры

#КонецОбласти
